---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctLining
source: html/16f6eb18-ffbb-94f8-f533-05bb3ce89bfa.htm
---
# DuctLining Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.